app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."id" ASC
---
  def index
    @tasks = Task.all

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 980190965], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["completed", false], ["completion_date", nil], ["updated_at", "2019-04-14 01:23:10.141335"], ["id", 980190963]]
---
    task = Task.find_by(id: task_id)

    task.completed = !task.completed

    if task.completed
      task.completion_date = Date.today
    else
      task.completion_date = nil
    end

    task.save