app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."completion_date" DESC, "tasks"."id" ASC
---
  def index
    @tasks = Task.all.order(completion_date: :desc)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    task_id = params[:id]
    @task = Task.find_by(id: task_id)

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Clean bathroom"], ["description", "Clean five bathrooms"], ["created_at", "2019-04-13 05:59:44.415939"], ["updated_at", "2019-04-13 05:59:44.415939"]]
---
    task = Task.new(name: params[:task][:name], description: params[:task][:description], completion_date: params[:task][:completion_date])
    if task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = $1, "due_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["name", "Clean bathrooms"], ["due_date", "2019-05-23 07:00:00"], ["updated_at", "2019-04-13 06:00:10.620786"], ["id", 13]]
---
    task = Task.find_by(id: params[:id])
    if task.nil?
      flash[:error] = "Could not find task with id: #{params[:id]}"
      redirect_to action: "index", status: 302
    else
      task.update(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 3]]
---
    task = Task.find_by(id: params[:id])
    if task.nil?
      flash[:error] = "Could not find task with id: #{params[:id]}"
      redirect_to action: "index", status: 302
    else
      task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", false], ["updated_at", "2019-04-11 22:38:57.868985"], ["id", 7]]
---
  def mark_complete
    @task = Task.find_by(id: params[:id])
    if @task.nil?
      flash[:error] = "Could not find task with id: #{params[:id]}"
      redirect_to action: "index", status: 302
    else
      @task.completion_date = Date.current
      @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2019-04-15 06:19:28.371747"], ["id", 5]]
---
  def mark_incomplete
    @task = Task.find_by(id: params[:id])
    if @task.nil?
      flash[:error] = "Could not find task with id: #{params[:id]}"
      redirect_to action: "index", status: 302
    else
      @task.completion_date = nil
      @task.save